ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Функция СформироватьШтрихкодТары()

	СформироватьШтрихкодТарыСервер();	

КонецФункции // СформироватьШтрихкодТары()

&НаСервере
Функция СформироватьШтрихкодТарыСервер()  
	
	Если ЗначениеЗаполнено(Объект.ТипТары) Тогда		
		Объект.Штрихкод = Справочники.вмс_Контейнеры.ПолучитьНовыйНомерТары(Объект.ТипТары); 
	Иначе
		Объект.Штрихкод = "";		
	КонецЕсли;

КонецФункции // СформироватьШтрихкодТары()

&НаКлиенте
Процедура ТипТарыПриИзменении(Элемент)
	СформироватьШтрихкодТары();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	вмс_УправлениеСвойствамиСервер.ПриСозданииНаСервере(ЭтаФорма, ЭтаФорма.Объект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстаткиКонтейнера.Параметры.УстановитьЗначениеПараметра("Контейнер", Объект.Ссылка);
	Иначе
		ОстаткиКонтейнера.Параметры.УстановитьЗначениеПараметра("Контейнер", Справочники.вмс_Контейнеры.ПустаяСсылка());
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	вмс_УправлениеСвойствамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	вмс_УправлениеСвойствамиСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//вмс_РаботаСФормамиКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

#Область Подключаемые_команды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Объект);
КонецПроцедуры

#КонецОбласти

//Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
КонецФункции

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ОбновитьДополнительныеРеквизитыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизитыНаСервере()
	вмс_УправлениеСвойствамиСервер.ОбновитьДополнительныеРеквизиты(ЭтаФорма);
КонецПроцедуры
